---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughAvailSlotsAndLugsOnPanel
source: html/c6e9395d-c554-0ab6-c74e-5cc62cc25d14.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughAvailSlotsAndLugsOnPanel Property

You can't connect to panel [Panel Name] because there aren't enough slots and Feed Through Lugs is occupied. \nYou can increase the [ParameterName] to be greater than [Number] to connect through breaker slots or you can disconnect existing Feed Through Lugs connection.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotEnoughAvailSlotsAndLugsOnPanel { get; }
```